7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_SDMMC.h
#define  _SDMMC1_STA_TXACT                                   (0x1 << 12)    // Data transmit in progress
#define  _SDMMC1_STA_CMDACT                                  (0x1 << 11)    // Command transfer in progress
#define  _SDMMC1_STA_DBCKEND                                 (0x1 << 10)    // Data block sent/received (CRC check passed)
#define  _SDMMC1_STA_STBITERR                                (0x1 << 9)    // Start bit not detected on all data signals in wide bus mode
#define  _SDMMC1_STA_DATAEND                                 (0x1 << 8)    // Data end (data counter, SDIDCOUNT, is zero)
#define  _SDMMC1_STA_CMDSENT                                 (0x1 << 7)    // Command sent (no response required)
#define  _SDMMC1_STA_CMDREND                                 (0x1 << 6)    // Command response received (CRC check passed)
#define  _SDMMC1_STA_RXOVERR                                 (0x1 << 5)    // Received FIFO overrun error
#define  _SDMMC1_STA_TXUNDERR                                (0x1 << 4)    // Transmit FIFO underrun error
#define  _SDMMC1_STA_DTIMEOUT                                (0x1 << 3)    // Data timeout
#define  _SDMMC1_STA_CTIMEOUT                                (0x1 << 2)    // Command response timeout
#define  _SDMMC1_STA_DCRCFAIL                                (0x1 << 1)    // Data block sent/received (CRC check failed)
#define  _SDMMC1_STA_CCRCFAIL                                (0x1 << 0)    // Command response received (CRC check failed)
#define  _SDMMC1_ICR_CEATAENDC                               (0x1 << 23)    // CEATAEND flag clear bit
#define  _SDMMC1_ICR_SDIOITC                                 (0x1 << 22)    // SDIOIT flag clear bit
#define  _SDMMC1_ICR_DBCKENDC                                (0x1 << 10)    // DBCKEND flag clear bit
#define  _SDMMC1_ICR_STBITERRC                               (0x1 << 9)    // STBITERR flag clear bit
#define  _SDMMC1_ICR_DATAENDC                                (0x1 << 8)    // DATAEND flag clear bit
#define  _SDMMC1_ICR_CMDSENTC                                (0x1 << 7)    // CMDSENT flag clear bit
#define  _SDMMC1_ICR_CMDRENDC                                (0x1 << 6)    // CMDREND flag clear bit
#define  _SDMMC1_ICR_RXOVERRC                                (0x1 << 5)    // RXOVERR flag clear bit
#define  _SDMMC1_ICR_TXUNDERRC                               (0x1 << 4)    // TXUNDERR flag clear bit
#define  _SDMMC1_ICR_DTIMEOUTC                               (0x1 << 3)    // DTIMEOUT flag clear bit
#define  _SDMMC1_ICR_CTIMEOUTC                               (0x1 << 2)    // CTIMEOUT flag clear bit
#define  _SDMMC1_ICR_DCRCFAILC                               (0x1 << 1)    // DCRCFAIL flag clear bit
#define  _SDMMC1_ICR_CCRCFAILC                               (0x1 << 0)    // CCRCFAIL flag clear bit
#define  _SDMMC1_MASK_CEATAENDIE                             (0x1 << 23)    // CE-ATA command completion signal received interrupt enable
#define  _SDMMC1_MASK_SDIOITIE                               (0x1 << 22)    // SDIO mode interrupt received interrupt enable
#define  _SDMMC1_MASK_RXDAVLIE                               (0x1 << 21)    // Data available in Rx FIFO interrupt enable
#define  _SDMMC1_MASK_TXDAVLIE                               (0x1 << 20)    // Data available in Tx FIFO interrupt enable
#define  _SDMMC1_MASK_RXFIFOEIE                              (0x1 << 19)    // Rx FIFO empty interrupt enable
#define  _SDMMC1_MASK_TXFIFOEIE                              (0x1 << 18)    // Tx FIFO empty interrupt enable
#define  _SDMMC1_MASK_RXFIFOFIE                              (0x1 << 17)    // Rx FIFO full interrupt enable
#define  _SDMMC1_MASK_TXFIFOFIE                              (0x1 << 16)    // Tx FIFO full interrupt enable
#define  _SDMMC1_MASK_RXFIFOHFIE                             (0x1 << 15)    // Rx FIFO half full interrupt enable
#define  _SDMMC1_MASK_TXFIFOHEIE                             (0x1 << 14)    // Tx FIFO half empty interrupt enable
#define  _SDMMC1_MASK_RXACTIE                                (0x1 << 13)    // Data receive acting interrupt enable
#define  _SDMMC1_MASK_TXACTIE                                (0x1 << 12)    // Data transmit acting interrupt enable
#define  _SDMMC1_MASK_CMDACTIE                               (0x1 << 11)    // Command acting interrupt enable
#define  _SDMMC1_MASK_DBCKENDIE                              (0x1 << 10)    // Data block end interrupt enable
#define  _SDMMC1_MASK_STBITERRIE                             (0x1 << 9)    // Start bit error interrupt enable
#define  _SDMMC1_MASK_DATAENDIE                              (0x1 << 8)    // Data end interrupt enable
#define  _SDMMC1_MASK_CMDSENTIE                              (0x1 << 7)    // Command sent interrupt enable
#define  _SDMMC1_MASK_CMDRENDIE                              (0x1 << 6)    // Command response received interrupt enable
#define  _SDMMC1_MASK_RXOVERRIE                              (0x1 << 5)    // Rx FIFO overrun error interrupt enable
#define  _SDMMC1_MASK_TXUNDERRIE                             (0x1 << 4)    // Tx FIFO underrun error interrupt enable
#define  _SDMMC1_MASK_DTIMEOUTIE                             (0x1 << 3)    // Data timeout interrupt enable
#define  _SDMMC1_MASK_CTIMEOUTIE                             (0x1 << 2)    // Command timeout interrupt enable
#define  _SDMMC1_MASK_DCRCFAILIE                             (0x1 << 1)    // Data CRC fail interrupt enable
#define  _SDMMC1_MASK_CCRCFAILIE                             (0x1 << 0)    // Command CRC fail interrupt enable
#define  _SDMMC1_FIFOCNT_FIFOCOUNT                           (0xffffff << 0)    // Remaining number of words to be written to or read from the FIFO
#define  _SDMMC1_FIFO_FIFOData                               (0xffffffff << 0)    // Receive and transmit FIFO data
